{
   "intents":[
    {
        "tag": "greeting", 
        "phrases": ["hello", "hi", "hey", "howdy", "greetings"],
        "responses": ["Hello! How can I assist you today?"]
    },
   
    {
        "tag" : "weather",
        "phrases": ["What's the weather like today?", "Tell me about the weather", "Is it going to rain?", "How's the weather?"],
        "responses": ["I'm sorry, I don't have real-time weather information."]
    },
       
    {
        "tag" : "goodbye",
        "phrases": ["goodbye", "bye", "see you later", "farewell"],
        "responses": ["Goodbye! Have a great day."]
    },

    {
        "tag" : "thanks",
        "phrases": ["thank you", "thanks", "thanks a lot", "appreciate it"],
        "responses": ["You're welcome! If you have more questions, feel free to ask."]
    },

    {
        "tag" : "conversation", 
        "phrases": ["tell me a joke", "talk to me", "anything interesting?"],
        "responses": ["Sure, here's a joke: Knock Knock."]
    },

    {
        "tag": "Psoriasis",
        "phrases": [
        "I have been experiencing a skin rash on my arms, legs, and torso for the past few weeks. It is red, itchy, and covered in dry, scaly patches.",
        "My skin has been peeling, especially on my knees, elbows, and scalp. This peeling is often accompanied by a burning or stinging sensation.",
        "I have been experiencing joint pain in my fingers, wrists, and knees. The pain is often achy and throbbing, and it gets worse when I move my joints.",
        "There is a silver like dusting on my skin, especially on my lower back and scalp. This dusting is made up of small scales that flake off easily when I scratch them.",
        "My nails have small dents or pits in them, and they often feel inflammatory and tender to the touch. Even there are minor rashes on my arms.",
        "The skin on my palms and soles is thickened and has deep cracks. These cracks are painful and bleed easily.",
        "The skin around my mouth, nose, and eyes is red and inflamed. It is often itchy and uncomfortable. There is a noticeable inflammation in my nails.",
        "My skin is very sensitive and reacts easily to changes in temperature or humidity. I often have to be careful about what products I use on my skin.",
        "I have noticed a sudden peeling of skin at different parts of my body, mainly arms, legs and back. Also, I face severe joint pain and skin rashes.",
        "The skin on my genitals is red and inflamed. It is often itchy, burning, and uncomfortable. There are rashes on different parts of the body too.",
        "I have experienced fatigue and a general feeling of malaise. I often feel tired and have a lack of energy, even after a good night's sleep.",
        "The rash on my skin has spread to other parts of my body, including my chest and abdomen. It is itchy and uncomfortable, and it is often worse at night. I am also facing skin peeling.",
        "The rash on my skin is worse in the winter months when the air is dry. I find that I have to moisturize more frequently and use humidifiers to keep my skin hydrated.",
        "I have experienced difficulty sleeping due to the itching and discomfort caused by the rash. There are small dents in my nails, which is really concerning.",
        "My skin is prone to infections due to dry, flaky patches. I am experiencing a strong pain in my joints. The skin on my knees and elbows is starting to peel off.",
        "I am starting to have rashes on my skin. The rash often bleeds when I scratch or rub it. Moreover, I have noticed small dents in my nails.",
        "I have noticed that my skin has become more sensitive than it used to be. There is a silver like dusting on my skin, especially on my back and elbows.",
        "I am worried about the constant peeling of the skin on my palm, elbow and knee. I have developed rashes on my arms, which itch if I touch them. All of these are making my life quite discomforting and miserable.",
        "There is strange pain in my joints. Also, I have noticed strange peeling of skin in different parts of my body. I am afraid there is something wrong going on with my body.",
        "My nails have small dents on them. Even my joints have started to pain severely. There is a silver like dusting on my skin, particularly in my back.",
        "The rashes on my skin are not healing. Moreover, I have noticed a sudden peeling of the skin, especially the skin on my elbows and knees. I am really worried about this.",
        "For the past few weeks, I've had a skin rash on my arms, legs, and chest. It's red and irritating, with dry, scaly spots. I have a strange pain in my joints too.",
        "My skin is peeling, particularly on my knees, elbows, and scalp. This peeling is frequently accompanied by a stinging or burning feeling.",
        "I'm having joint discomfort in my fingers, wrists, and knees. The pain is frequently aching and throbbing, and it worsens when I move my joints.",
        "My skin has a silvery film, particularly on my back, arms and scalp. This dusting is composed of tiny scales that easily peel off when scratched.",
        "I have red and inflammatory skin around my mouth, nose, and eyes. It is frequently irritating and unpleasant. Recently, it has got very painful."],
        "responses": ["I understand you're concerned about the red, itchy rash on your arms, legs, and torso. These symptoms could be related to psoriasis, but a doctor or dermatologist can provide a proper diagnosis and recommend the best treatment plan.",
        "The peeling skin, especially on your knees, elbows, and scalp, along with the burning or stinging sensation could be signs of psoriasis. Consulting a doctor or dermatologist will help determine the cause and suggest suitable treatment options.",
        "Achy and throbbing joint pain in your fingers, wrists, and knees, especially when moving, could be related to psoriasis or other conditions. A doctor can diagnose the cause and recommend appropriate treatment for both your joints and skin.",
        "The silvery \"dusting\" on your lower back and scalp, made up of small, easily flaking scales, could be a symptom of psoriasis. A doctor can confirm the diagnosis and suggest treatment options to manage the flaking and discomfort.",
        "Small dents or pits in your nails, along with inflammation and tenderness, and minor rashes on your arms, could be signs of psoriasis. A doctor can examine your nails and rashes to provide a diagnosis and recommend effective treatment.",
        "Thickened skin with deep cracks on your palms and soles, causing pain and bleeding, could be a symptom of psoriasis. Please see a doctor for a proper diagnosis and treatment plan to manage the pain and prevent further complications.",
        "Red, inflamed skin around your mouth, nose, and eyes, along with itchy discomfort and nail inflammation, could be signs of psoriasis. A doctor can confirm the diagnosis and suggest targeted treatment for these sensitive areas.",
        "Very sensitive skin that reacts easily to temperature or humidity changes could be a symptom of psoriasis or other skin conditions. A doctor can help identify the cause and recommend geeignete skincare strategies to manage your sensitivity.",
        "Sudden skin peeling on your arms, legs, and back, combined with severe joint pain and skin rashes, warrants a doctor's visit. They can diagnose the cause and provide treatment for both your skin and joints.",
        "Red, inflamed, itchy, and burning skin on your genitals, along with rashes on other body parts, could be a sign of psoriasis or other conditions. Please see a doctor for a diagnosis and appropriate treatment plan for your genital area.",
        "Fatigue and malaise, even after a good night's sleep, could be related to various conditions, including psoriasis. A doctor can help identify the underlying cause and suggest treatment options to improve your energy levels.",
        "A spreading rash on your chest and abdomen, causing itchiness and discomfort, especially at night, along with skin peeling, could be related to psoriasis. A doctor can confirm the diagnosis and recommend treatment",
        "Worsening skin rash during dry winter months might be due to psoriasis. A doctor can advise on additional moisturizing and suggest using humidifiers to manage your symptoms effectively.",
        "Difficulty sleeping due to itching and discomfort from the rash, along with concerning nail dents, necessitates a doctor's visit. They can diagnose the cause, address your sleep issues, and recommend treatment for your skin and nails.",
        "Skin prone to infections due to dryness and flakiness, combined with strong joint pain and peeling knees and elbows, requires a doctor's consultation. They can diagnose the cause, recommend treatments for your skin and joints, and help prevent infections.",
        "New rashes that bleed when scratched or rubbed, along with nail dents, warrant a doctor's visit. They can diagnose the cause, recommend appropriate treatment for your skin and nails, and advise on managing the bleeding.",
        "Increased skin sensitivity and silvery \"dusting\" on your back and elbows could be signs of psoriasis. A doctor can confirm the diagnosis and suggest treatment options to manage the sensitivity and flaking.",
        "Constant peeling on your palms, elbows, and knees, along with itchy rashes on your arms, can be very uncomfortable. Please see a doctor for a diagnosis and treatment plan to address the peeling, rashes, and overall discomfort.",
        "Strange joint pain and unusual skin peeling in different areas raise concerns. A doctor can help identify the cause of these symptoms and recommend appropriate treatment.",
        "Nail dents and severe joint pain, combined with silvery \"dusting\" on your back, warrant a doctor's visit. They can diagnose the cause, recommend treatment for your skin and joints, and address your concerns.",
        "Unhealing rashes and sudden skin peeling, especially on your elbows and knees, require medical attention. Please see a doctor for a diagnosis and treatment plan to manage these symptoms and ease your worries.",
        "A red, itchy rash with dry, scaly patches on your arms, legs, and chest, combined with joint pain, necessitates a doctor's visit. They can diagnose the cause, recommend treatment for your skin and joints, and offer reassurance.",
        "Peeling skin, especially on your knees, elbows, and scalp, along with a stinging or burning sensation, could be signs of psoriasis. Consulting a doctor or dermatologist will help determine the cause and suggest suitable treatment options.",
        "Aching and throbbing joint pain in your fingers, wrists, and knees, especially when moving, could be related to psoriasis or other conditions. A doctor can diagnose the cause and recommend appropriate treatment for both your joints and skin.",
        "A silvery film on your skin, especially on your back, arms, and scalp, composed of tiny scales that easily peel off when scratched, could be a sign of psoriasis. A doctor can confirm the diagnosis and suggest treatment options to manage the flaking and discomfort.",
        "Red and inflamed skin around your mouth, nose, and eyes, along with itching and discomfort, could be signs of psoriasis or other conditions. A doctor can confirm the diagnosis and suggest targeted treatment for these sensitive areas."
    ]
    },
    {
    "tag": "Varicose Veins",
    "phrases": [
        "A rash on my legs is causing discomfort, with cramps and prominent veins on my calves. I've also been feeling tired and fatigued lately.",
        "My calves cramp when I walk or stand for long periods. There are bruises on my calves, and I feel tired easily.",
        "I have unexplained bruising on my legs with visible blood vessels. I'm slightly overweight and worried.",
        "I'm overweight and noticed swollen legs with visible blood vessels.",
        "Prominent veins on my calves cause discomfort and pain like cramps when standing for long periods.",
        "The skin around my leg veins is red and inflamed. I see swollen blood vessels and am worried.",
        "Standing or walking for long periods causes leg pain and cramps. I also get bruises.",
        "Calve cramps make walking difficult, and I feel fatigued after work. I suspect obesity is the cause.",
        "Leg swelling has worsened over the past few weeks, with many noticeable veins on my calves, causing worry.",
        "Very noticeable leg veins cause discomfort. There seems to be a major bruise, and I get cramps when running.",
        "Calf skin has become inflamed and red. Legs hurt when running or doing any physical activity.",
        "Recent constant calf pain worsens with standing/walking for long periods. Legs have started to swell, and some blood vessels are quite noticeable.",
        "Leg veins cause discomfort and difficulty sleeping at night. I have no idea why it's happening, and I get cramps when sprinting.",
        "The swelling in my legs is causing me to have difficulty fitting into my shoes. I can't sprint or stand for long periods of time. I can see some swollen blood vessels.",
        "I have noticed cramps in my calves are becoming more frequent and intense. It is causing me a lot of discomforts. I am also overweight and my legs have started to swell.",
        "The veins on my legs cause a lot of discomforts when I sit for long periods of time.",
        "The rash on my legs is spreading and becoming more severe. It has become very difficult for me to run.",
        "My legs are causing a lot of discomforts when I exercise. I get frequent cramps and the blood vessels have become quite noticeable.",
        "The prominent blood vessels on my calves are causing self-consciousness and embarrassment. I believe the problem is because of my overweight.",
        "The skin around the veins on my legs is dry and flaky. It seems there is a major bruise and my legs have started to swell.",
        "I have been experiencing a rash on my legs that is causing a lot of irritation and discomfort. It is red and inflamed and appears to be spreading."
    ],
    "responses": [
        "A rash, cramps, prominent veins, and fatigue could indicate varicose veins or other conditions. Please see a doctor for diagnosis and treatment. Consider mentioning fatigue separately for a broader assessment.",
        "Calf cramps, bruises, fatigue, and visible veins warrant a doctor's visit. They can assess the cause, address your concerns, and suggest treatment options for cramps, fatigue, and potential varicose veins.",
        "Unexplained bruising, visible blood vessels, and weight concerns necessitate a doctor's consultation. They can determine the cause of the bruising and veins, address your weight concerns, and suggest appropriate management strategies.",
        "Swelling, visible veins, and weight suggest potential varicose veins. See a doctor for diagnosis and a personalized treatment plan, considering your weight and specific symptoms.",
        "Prominent veins causing discomfort and pain like cramps during prolonged standing could be varicose veins. Consult a doctor for diagnosis and treatment options to manage pain and discomfort.",
        "Red and inflamed skin around veins, visible swollen vessels, and worry warrant a doctor's visit. They can diagnose the cause, address your concerns, and recommend treatment for both the skin and potential varicose veins.",
        "Leg pain, cramps during activity, and bruises necessitate a doctor's visit. They can diagnose the cause, address your concerns, and recommend treatment options for pain, cramps, and potential varicose veins.",
        "While obesity can be a factor, varicose veins themselves can cause cramps, fatigue, and swelling. Consult a doctor or vascular specialist for diagnosis and proper treatment, which may involve compression stockings, lifestyle changes, or minimally invasive procedures.",
        "Worsening swelling and visible veins suggest progression of varicose veins. Seek professional medical advice to prevent complications like skin ulcers or blood clots. Early diagnosis and treatment can greatly improve comfort and leg health.",
        "Visible veins, discomfort, and running-induced cramps are all signs of varicose veins. The \"bruise\" might be localized swelling due to pooled blood. Consulting a doctor can confirm the diagnosis and explore treatment options like sclerotherapy or laser therapy to relieve discomfort and improve appearance.",
        "Inflammation and pain during activity are concerning symptoms of varicose veins. See a doctor or vascular specialist to rule out other potential causes and discuss treatment options like compression therapy or minimally invasive procedures to address the inflammation and pain, and improve your ability to exercise comfortably.",
        "Constant pain, worsening with standing/walking, swelling, and visible veins are all classic signs of varicose veins. Seek professional medical advice to prevent further complications and explore treatment options like medication, compression therapy, or minimally invasive procedures to manage the pain, swelling, and improve circulation.",
        "Varicose veins can definitely cause discomfort and disrupt sleep. While the cause needs professional diagnosis, the mentioned symptoms strongly suggest varicose veins. Consulting a doctor or vascular specialist can provide clarity and explore treatment options like lifestyle changes, compression stockings, or minimally invasive procedures to improve your sleep quality and address the cramps and discomfort.",
        "Worsening leg swelling, limited mobility, and visible blood vessels suggest varicose veins. Seeking professional medical advice is crucial. Early diagnosis and treatment options like compression stockings or minimally invasive procedures can improve comfort and mobility.",
        "Increasing calf cramps, discomfort, overweight, and leg swelling point towards possible varicose veins. Consult a doctor or vascular specialist to confirm the cause and explore treatment options like lifestyle changes, compression therapy, or medication to manage cramps, swelling, and potential weight-related factors.",
        "Discomfort in legs while sitting for extended periods can be a sign of varicose veins. Consider consulting a doctor or vascular specialist. They can diagnose the cause and suggest treatment options like lifestyle modifications, compression stockings, or minimally invasive procedures to address the discomfort.",
        "A spreading and worsening rash requires immediate medical attention. Do not ignore it. Consult a doctor or dermatologist to rule out other potential causes and determine the best course of treatment for the rash, ensuring it doesn't affect your running ability.",
        "Leg discomfort during exercise, frequent cramps, and noticeable blood vessels suggest varicose veins. Seek professional medical advice. Early diagnosis and treatment options like compression therapy, medication, or minimally invasive procedures can alleviate discomfort, manage cramps, and improve exercise tolerance.",
        "While weight can be a factor, consult a doctor or vascular specialist for a proper diagnosis and personalized treatment plan. They can address the visible veins and explore weight management strategies, if appropriate.",
        "Dry, flaky skin, potential \"bruise\" (localized swelling), and leg swelling suggest varicose veins. Seek professional medical advice. These symptoms might indicate complications. Early diagnosis and treatment options like compression therapy, medication, or minimally invasive procedures can address the skin concerns, swelling, and underlying varicose veins.",
        "A spreading, irritating, red, and inflamed rash on legs requires immediate medical attention. Consult a doctor or dermatologist immediately. A spreading rash can indicate various conditions, and prompt diagnosis and treatment are crucial to prevent complications."
    ]
    },
    {
    "tag": "Typhoid",
    "phrases": [
        "I have constipation and belly pain, and it's getting worse. It affects my daily life. I also get chills every night, followed by a mild fever.",
        "I've had some diarrhea, which is unpleasant. It comes and goes, with abdominal cramps and bloating.",
        "I experience chills and fever, along with severe abdominal pain. I feel miserable and can't shake these symptoms.",
        "I have trouble keeping hydrated due to vomiting and diarrhea. There is a mild fever with constipation and headache.",
        "I lost weight in the past week because I haven't been able to eat much due to nausea and vomiting. This is followed by mild fever, headache, and belly pain. I'm concerned about my health.",
        "The fatigue is uncomfortable, and I have difficulties doing my usual activities. I also feel depressed and irritable with mild abdominal pain.",
        "I've had a persistent headache for the past week, worsening. It's accompanied by belly aches, constipation, and diarrhea.",
        "I experience high fever, especially at night, with mild headache, constipation, and diarrhea.",
        "I have difficulty breathing and feel constantly nauseous with mild belly pain. It's terrifying at times.",
        "Diarrhea is watery and foul-smelling, with abdominal pain. I feel like vomiting most of the time.",
        "I have trouble sleeping due to high fever, headache, and chills. I wake up daily with terrible pain in my belly area.",
        "I've also been experiencing some diarrhea and constipation, which has been really worrying. It feels like a sharp, stabbing pain in my belly area. I feel tired all the time.",
        "I have had some constipation and belly pain, which has been really uncomfortable. The pain has been getting worse and it's really affecting my daily life.",
        "I am experiencing a lot of belly pain and constipation, which has been really annoying. Sometimes, I feel a strong urge to vomit, and because of all of these, I am feeling very weak.",
        "The abdominal pain has been coming and going, and it's been really unpleasant. It's been accompanied by constipation and vomiting. I feel really concerned about my health.",
        "I have been experiencing a lot of bloating and constipation, and it's been really uncomfortable. It feels like there's a lot of pressure and pain in my belly area.",
        "I am experiencing extreme belly pain and constipation. Every night, I have a severe fever along with chills and headaches. The last couple of days has been really uncomfortable.",
        "I've been feeling exhausted and weak, and I can't seem to get rid of it. Because of the vomiting and nausea, I've entirely lost my appetite. My belly pains which are causing me concern.",
        "I am experiencing constipation and stomach ache, which has been really difficult. The discomfort has gotten worse, and it is seriously interfering with my everyday life.",
        "Because of the vomiting and diarrhea, I've been having a lot of difficulties staying hydrated. I have a high fever, as well as constipation and headache.",
        "The abdominal pain has been frequent and really painful. Constipation and vomiting have also occurred. I'm quite worried about my health."
    ],
    "responses": [
        "These symptoms can be caused by various conditions, including typhoid fever, but also gastrointestinal infections, appendicitis, inflammatory bowel disease (IBD), or other issues. Seek immediate medical attention for diagnosis and treatment.",
        "While these symptoms can occur in typhoid fever, they could also indicate food poisoning, irritable bowel syndrome (IBS), lactose intolerance, or other issues. Don't delay seeking prompt medical evaluation for diagnosis and appropriate treatment.",
        "These symptoms can be serious and require immediate medical attention. They could be caused by typhoid fever, but also severe infections, appendicitis, kidney stones, or other conditions. Seek prompt diagnosis and treatment by a healthcare professional.",
        "These symptoms can lead to dehydration and other complications if left untreated. They could be caused by typhoid fever, other infections, gastroenteritis, or other issues. Seek immediate medical attention for evaluation, rehydration, and treatment.",
        "These symptoms can be serious and indicate various conditions, including typhoid fever, food poisoning, gastrointestinal infections, liver problems, or others. Do not delay seeking urgent medical evaluation for diagnosis and treatment.",
        "While these symptoms can occur in typhoid fever, they could also indicate chronic fatigue syndrome, depression, anemia, thyroid problems, or other conditions. Seek medical attention for diagnosis and proper management.",
        "These symptoms can be related to various conditions, including typhoid fever, migraines, dehydration, neurological issues, or others. A healthcare professional can provide an accurate diagnosis and proper treatment plan. Seek medical evaluation.",
        "These symptoms can be severe and require immediate medical attention. They could be caused by typhoid fever, severe infections, urinary tract infections (UTIs), or other conditions. Seek prompt diagnosis and treatment by a healthcare professional.",
        "These symptoms can be life-threatening and need immediate medical attention. They could be caused by pneumonia, asthma, allergic reactions, appendicitis, or other serious conditions. Don't delay seeking help - call emergency services if necessary.",
        "These symptoms raise concerns about dehydration and potential underlying conditions, including typhoid fever, food poisoning, severe infections, or others. Seek immediate medical attention for evaluation, rehydration, and appropriate treatment.",
        "These symptoms can be serious and require immediate medical attention. They could be caused by typhoid fever, severe infections, meningitis, or other conditions. Seek prompt diagnosis and treatment by a healthcare professional.",
        "These symptoms can be caused by various conditions, including typhoid fever, but also gastrointestinal infections, appendicitis, inflammatory bowel disease (IBD), or other issues. Seek immediate medical attention for diagnosis and treatment.",
        "These symptoms can be caused by various conditions, including typhoid fever, but also gastrointestinal infections, appendicitis, or other issues. Seek immediate medical attention for diagnosis and treatment.",
        "These symptoms can be caused by various conditions, including typhoid fever, but also gastrointestinal infections, irritable bowel syndrome (IBS), or other issues. Seek medical attention for diagnosis and proper management.",
        "These symptoms can be caused by various conditions, including typhoid fever, but also food poisoning, gastrointestinal infections, or other issues. Don't delay seeking prompt medical evaluation for diagnosis and appropriate treatment.",
        "These symptoms can be caused by various conditions, including typhoid fever, but also constipation, bloating, or other issues. Seek medical attention for proper diagnosis and management.",
        "These symptoms can be serious and require immediate medical attention. They could be caused by typhoid fever, but also severe infections, appendicitis, or other conditions. Seek prompt diagnosis and treatment by a healthcare professional.",
        "These symptoms can be caused by various conditions, including typhoid fever, but also food poisoning, gastrointestinal infections, or other issues. Seek immediate medical attention for diagnosis and appropriate treatment.",
        "These symptoms can be caused by various conditions, including typhoid fever, but also constipation, gastrointestinal issues, or other problems. Seek medical attention for diagnosis and proper management.",
        "These symptoms can lead to dehydration and other complications if left untreated. They could be caused by typhoid fever, other infections, gastroenteritis, or other issues. Seek immediate medical attention for evaluation, rehydration, and treatment.",
        "These symptoms can be caused by various conditions, including typhoid fever, but also gastrointestinal infections, appendicitis, or other issues. Seek immediate medical attention for diagnosis and treatment."
    ]
    },
    {
    "tag": "Chicken pox",
    "phrases": [
        "I've been experiencing intense itching all over my skin, and it's driving me crazy. I also have a rash that's red and inflamed.",
        "I'm feeling fatigued and have no energy. I can barely keep my eyes open during the day, and I've been feeling lethargic and unable to motivate myself.",
        "I've had a high fever for the past few days. I don't know what's causing it. Also, I noticed rashes on my skin and it's hard for me to resist scratching.",
        "I've lost my appetite and can't seem to eat anything. I'm worried about my health.",
        "There are small red spots all over my body that I can't explain. It's worrying me. I feel extremely tired and experience a mild fever every night.",
        "My lymph nodes are swollen, causing discomfort in my neck and armpits. I don't know what's causing it.",
        "I'm feeling really sick and uncomfortable like something is wrong inside. I don't know what it could be. I noticed small red spots on my arms, which itches if I touch them.",
        "The itching is making it hard for me to sleep at night. I can't get any rest. I have also lost my appetite and feel lethargic.",
        "I'm worried about this rash on my skin. It's spreading rapidly and causing a lot of discomforts. I can hardly sleep at night because of the itching.",
        "I have no energy and have lost my appetite. I'm feeling really sick and don't know what's wrong.",
        "I have a skin rash that's red and inflamed, and it's spreading all over my body. I've been experiencing intense itching, especially on my arms and legs.",
        "I've had a high fever for the past few days, and it's starting to worry me. I don't know what's causing it. Also, I have red spots all over my arms and legs, some of which are swollen.",
        "I have a skin rash that's red and swollen, and it's spreading all over my body. I have a mild fever and it is causing me a lot of discomforts.",
        "I'm feeling fatigued and have no energy. I can barely keep my eyes open during the day, and I've been feeling lethargic and unable to motivate myself.",
        "There are small red spots all over my body that I can't explain. The bumps are itchy and uncomfortable and seem to spread rapidly. It's worrying me.",
        "The itching is making it hard for me to sleep at night. I can't seem to get any rest because the rash is so itchy and uncomfortable. I'm feeling really tired and exhausted.",
        "I have no energy and have lost my appetite. I have a high fever and severe headache and don't know what's wrong.",
        "The high fever and swollen lymph nodes are causing me much discomfort. I have a headache and feel weak and fatigued. It's hard for me to concentrate because of the fever.",
        "The rash on my skin is causing a lot of discomforts. It's red and inflamed, spreading all over my body. The rash is accompanied by intense itching, especially on my arms and legs.",
        "There are red spots all over my body that I can't explain. The spots are itchy and starting to swell, and they are spreading rapidly.",
        "I have small lymph nodes on my arms and face. The itching is making my day very uncomfortable.",
        "I have no energy and have lost my appetite. I'm feeling really sick and don't know what's wrong. Also, there are small red spots starting to show on my skin."
    ],
    "responses": [
        "These symptoms could indicate chickenpox, but also other conditions like allergic reactions or shingles. Seek medical attention for diagnosis and treatment.",
        "While these can be symptoms of chickenpox, they could also be related to other illnesses or even stress. Seek medical advice to determine the cause and appropriate management.",
        "These symptoms are consistent with chickenpox, but require confirmation by a healthcare professional. Seek immediate medical attention for diagnosis and treatment.",
        "Loss of appetite can occur with various conditions, including chickenpox. Seek medical attention for assessment and proper management.",
        "These symptoms could be chickenpox, but also other infections or allergic reactions. Seek medical evaluation for diagnosis and appropriate treatment.",
        "Swollen lymph nodes can occur with various infections, including chickenpox. Seek medical attention for diagnosis and treatment of the underlying cause.",
        "These symptoms could indicate chickenpox, but also other illnesses. Seek medical attention for diagnosis and proper management.",
        "These symptoms are commonly associated with chickenpox. Seek medical evaluation for confirmation and appropriate treatment.",
        "This could be chickenpox, but requires medical confirmation. Seek immediate medical attention for diagnosis and treatment.",
        "These symptoms can occur with various conditions, including chickenpox. Seek medical attention for assessment and proper management.",
        "These symptoms are consistent with chickenpox, but require confirmation by a healthcare professional. Seek immediate medical attention for diagnosis and treatment.",
        "Your symptoms could be consistent with chickenpox. It's important to see a doctor for diagnosis and treatment.",
        "Your symptoms could be consistent with chickenpox. It's important to see a doctor for diagnosis and treatment.",
        "Fatigue and lack of energy can be symptoms of various conditions, including chickenpox. It's important to see a doctor for diagnosis and treatment.",
        "A sudden rash with unexplained red spots could be a sign of chickenpox or other conditions. It's important to see a doctor for diagnosis and treatment.",
        "Itchy rash and sleep disturbances are common symptoms of chickenpox. It's important to see a doctor for diagnosis and treatment.",
        "Fever, headache, and loss of appetite can be symptoms of chickenpox or other illnesses. It's important to see a doctor for diagnosis and treatment.",
        "Fever, swollen lymph nodes, and fatigue can be symptoms of chickenpox or other conditions. It's important to see a doctor for diagnosis and treatment.",
        "Red, inflamed rash with intense itching is a common symptom of chickenpox. It's important to see a doctor for diagnosis and treatment.",
        "A sudden rash with unexplained red spots could be a sign of chickenpox or other conditions. It's important to see a doctor for diagnosis and treatment.",
        "Swollen lymph nodes and itching can be symptoms of chickenpox or other conditions. It's important to see a doctor for diagnosis and treatment.",
        "Loss of energy, loss of appetite, and red spots could be symptoms of chickenpox or other conditions. It's important to see a doctor for diagnosis and treatment."
    ]
    },
    {
    "tag": "Impetigo",
    "phrases": [
        "I have developed a skin rash on my face and neck. The rash is made up of red sores that are blistering. I am worried about my health.",
        "I have developed skin rashes made up of blistering sores. The blistering sores are raised, fluid-filled lesions and they are painful to touch. I am also suffering from a high fever.",
        "I have a high fever. There are red sores developing near my nose. The sores are painful and have yellow rust-colored ooze coming out from them.",
        "There are rashes around my nose, with large red sores. I noticed that the rash was spreading to other parts of my body. Also, I have a high fever every night.",
        "I have been suffering from a high fever for the last couple of days. Sores are developing near my nose. The sores are painful and I am feeling very uncomfortable these days.",
        "My skin has developed rashes, mainly near the nose. The rash is spreading to other parts of my body. I am really about worried about this.",
        "I have been experiencing extreme fatigue and a high fever. There are rashes near my nose and mouth. The rash is itchy and makes it very difficult for me to sleep.",
        "I am suffering from extreme fever and weakness. I have developed sores on my face. The sores itchy and uncomfortable. Often, a yellow colored ooze comes out of the sores.",
        "I have noticed that the sores are taking longer to heal and are more prone to infection. The sores on my face are swollen and tender to the touch and very uncomfortable to handle.",
        "The sores around my nose have become crusted over and are difficult to touch. A yellow-rust coloured ooze used to come out of the sores. It is taking much more time to handle.",
        "I developed a minor rash near my nose a few days ago. Now, the rash is accompanied by a burning sensation and redness of the skin. I feel it is some kind of an infection.",
        "Initially, I developed small red sores near my nose and neck. Now, I am having a high fever and the sores have become more painful and inflamed over the past few days.",
        "I noticed a skin rash on my face. It was made up of a blistering sore. Today I observed a yellow colored fluid coming out of the sores, I am not sure what it is.",
        "The sores on my face are beginning to weep clear fluid. Also, every night I get a high fever and chills, because of which I cannot sleep all night.",
        "I initially had rashes on my face and near my nose. But now the rash is spreading down my arms and legs."
    ],
    "responses": [
        "Your concerns are valid! The symptoms you describe could be consistent with Impetigo, a contagious bacterial skin infection. While I can't diagnose you, it's crucial to see a doctor immediately for a proper diagnosis and treatment plan. Impetigo is highly contagious, so early diagnosis and treatment are essential to prevent spreading it to others.",
        "These symptoms raise concerns for Impetigo, especially with the high fever. Remember, Impetigo is contagious, so please consult a doctor as soon as possible to confirm the diagnosis and receive proper treatment. Early intervention helps prevent spreading the infection and ensures faster recovery.",
        "The combination of fever, painful sores, and oozing suggests a possible Impetigo infection. Impetigo is contagious, so it's crucial to seek medical attention immediately. A doctor can confirm the diagnosis, prescribe appropriate treatment, and advise on preventing the spread of infection.",
        "The spreading rash and fever are concerning signs, potentially pointing towards Impetigo. This infection is contagious, so please prioritize seeing a doctor right away for diagnosis and treatment. Early intervention can prevent further spread and ensure your swift recovery.",
        "Considering the fever and painful sores, Impetigo could be a possibility. Remember, Impetigo is contagious, so it's essential to consult a doctor immediately for a proper diagnosis and treatment plan. Early medical attention can significantly improve your comfort and prevent spreading the infection.",
        "Your worries are understandable, and the spreading rash warrants immediate attention. The symptoms you describe could be consistent with Impetigo, a contagious bacterial skin infection. Please see a doctor right away for diagnosis and treatment. Early intervention is key to stop the spread and ensure your well-being.",
        "The combination of fatigue, fever, and itchy rash near your nose and mouth suggests a potential Impetigo infection. Remember, Impetigo is contagious, so it's vital to consult a doctor immediately to confirm the diagnosis and receive proper treatment. Early intervention can alleviate your discomfort, improve your sleep, and prevent spreading the infection.",
        "Given the fever, weakness, and oozing sores, Impetigo could be a possible cause. Please be aware that Impetigo is contagious, so it's critical to see a doctor right away for diagnosis and treatment. Early medical attention can help you feel better faster and prevent spreading the infection to others.",
        "Delayed healing, swollen sores, and discomfort point towards potential complications from Impetigo. Remember, Impetigo is contagious, so it's essential to see a doctor immediately for an evaluation and potential adjustment of your treatment plan. Early intervention can prevent further complications and ensure your comfort.",
        "While the crusting and past oozing suggest improvement, continued discomfort and delayed healing could signal complications from Impetigo. Remember, Impetigo is contagious, so it's crucial to consult a doctor immediately for a follow-up evaluation and ensure complete recovery.",
        "Your instincts are good! The burning sensation and worsening redness could indicate an expanding Impetigo infection. Remember, Impetigo is contagious, so it's crucial to see a doctor right away for a diagnosis and treatment plan. Early intervention helps prevent further spread and ensures faster healing.",
        "The worsening symptoms, including fever and increased pain, raise concerns about a potential Impetigo infection. Remember, Impetigo is contagious, so it's important to consult a doctor immediately for confirmation and appropriate treatment. Early intervention can alleviate your discomfort, reduce inflammation, and prevent further spread.",
        "Your description suggests potential Impetigo, especially with the yellow fluid. Remember, Impetigo is contagious, so it's crucial to see a doctor immediately for a proper diagnosis and treatment plan. Early intervention helps prevent the spread and ensures your swift recovery.",
        "Weeping sores, fever, and chills are concerning signs, possibly indicating complications from Impetigo. Remember, Impetigo is contagious, so it's critical to seek medical attention immediately. A doctor can confirm the diagnosis, adjust treatment if needed, and provide comfort measures to help you sleep better.",
        "The spreading rash is a significant concern, potentially indicating a worsening Impetigo infection. Remember, Impetigo is contagious, so it's crucial to see a doctor immediately for evaluation and potentially adjusted treatment. Early intervention is key to stop the spread and ensure your well-being."
    ]
    },
    {
    "tag": "Dengue",
    "phrases": [
        "I am facing severe joint pain and vomiting. I have developed a skin rash that covers my entire body and is accompanied by intense itching.",
        "I have been experiencing chills and shivering, despite being in a warm environment. My back pains all the time and there are red spots on my arms.",
        "I have been experiencing severe joint pain that makes it difficult for me to move and perform my daily activities. Also, I have lost my appetite because of which I feel weak.",
        "I have been vomiting frequently and have lost my appetite as a result. My joints and back pain all the time.",
        "I have a high fever accompanied with severe headache and body pain. I experience chills every night. There is a distinct pain behind my eyes too.",
        "I have been feeling extremely tired and fatigued, and I have no energy to do anything. I have developed rashes on my neck, which itch upon touching.",
        "I have been experiencing a severe headache that is accompanied by pain behind my eyes. I have lost my appetite and experience chills every night.",
        "I have been feeling nauseous and have a constant urge to vomit. There is a strong pain behind my eyes and there are small red spots all over my arms.",
        "I have developed red spots on my body that are itchy and inflamed. I am also experiencing high fever along with chills and shivering.",
        "I have been experiencing muscle pain that makes it difficult for me to move around. I have lost my appetite and feel vomiting. My legs and back pain a lot.",
        "I have been experiencing back pain that is worse when I sit or stand for a long time. Also, there are rashes all over my body. There is a pain behind my eyes too.",
        "The skin rash I have developed is accompanied by redness and swelling. I donâ€™t feel well as I have severe fever accompanied with body pain.",
        "The chills and shivering I have been experiencing are accompanied by a feeling of coldness and high fever. I have also developed rashes on my arms and red spots on my neck.",
        "The joint pain I have been experiencing is severe and feels like a constant ache. My head aches most of the time and I am starting to develop mild fever, accompanied with chills.",
        "The vomiting I have been experiencing is accompanied by stomach cramps and dizziness. I have lost my appetite and feel weak as a result. There is a pain behind my eyes too.",
        "The high fever I have been experiencing is accompanied by sweating and weakness. My muscles pain as a result I cannot work all day.",
        "The fatigue I have been feeling is extreme and makes it difficult for me to perform even basic tasks. I feel vomitting and developed rashes on my arms, neck and legs.",
        "The headache I have been experiencing is severe and is accompanied by a feeling of pressure in my head. I have mild fever along with headache. There are small red spots on my back.",
        "The nausea I have been feeling is accompanied by a loss of appetite and feeling of unease. There is a distinct pain in my back and muscles pain too.",
        "The muscle pain I have been experiencing is severe and feels like a constant ache. There are red spots all over my body and the itching is causing me a lot of discomfort.",
        "I have developed a skin rash that covers my entire body and is accompanied by intense itching. My body pains and I have a mild fever, accompanied with headache and chills."
    ],
    "responses": [
        "These symptoms, especially the rash and severe joint pain, could be signs of dengue fever, but other illnesses can also cause similar symptoms. It's crucial to seek immediate medical attention for proper diagnosis and treatment. Don't delay, especially if vomiting is severe or persistent.",
        "Chills, back pain, and red spots can be caused by dengue fever, but also by other infections like the flu. Seeing a doctor promptly for diagnosis and treatment is important to prevent complications.",
        "Severe joint pain and weakness can be signs of dengue fever, but arthritis and other conditions can also cause them. Consulting a doctor for diagnosis and treatment options is crucial to manage pain, improve mobility, and address the underlying cause.",
        "Frequent vomiting, loss of appetite, and joint/back pain could be caused by dengue fever, food poisoning, or other digestive issues. Seeking medical attention is essential, especially if vomiting is severe or persistent, to prevent dehydration and receive proper treatment.",
        "High fever, headache, body pain, chills, and eye pain can be symptoms of dengue fever, flu, or other infections. Seeing a doctor for diagnosis and treatment is important to prevent complications.",
        "Fatigue and rashes can be caused by dengue fever, other viral infections, or allergic reactions. Consulting a doctor to rule out underlying conditions and discuss treatment options, like antihistamines for potential allergies, is recommended.",
        "Severe headache, eye pain, chills, and loss of appetite could be caused by dengue fever, migraines, or other headache disorders. Seeing a doctor for diagnosis and treatment is crucial to prevent complications.",
        "Nausea, vomiting, eye pain, and red spots could be caused by dengue fever, food poisoning, or other digestive issues. Seeking medical attention, especially if vomiting is severe or persistent, is crucial to prevent dehydration and receive proper treatment.",
        "Red, itchy, inflamed spots, high fever, chills, and shivering can be caused by dengue fever, measles, or other viral infections. Seeing a doctor for diagnosis and treatment is important to prevent complications.",
        "Muscle pain, weakness, vomiting, loss of appetite, and back/leg pain could be caused by dengue fever, other muscle disorders, or digestive issues. Consulting a doctor for diagnosis and treatment options to manage pain, improve mobility, and address the underlying cause is crucial.",
        "Back pain, rashes, and eye pain could be caused by dengue fever, muscle strain, or other back problems. Seeing a doctor for diagnosis and treatment options to manage pain, improve mobility, and address the underlying cause is recommended.",
        "This could be dengue fever, but other illnesses can also cause similar symptoms. Seek immediate medical attention, especially for the severe fever and body pain. Don't delay!",
        "While dengue fever is possible, flu or other infections could also explain these symptoms. See a doctor promptly for diagnosis and treatment to prevent complications.",
        "Dengue fever could be the culprit, but arthritis or other joint conditions are also possibilities. See a doctor for diagnosis and treatment options to manage pain, reduce fever, and address the underlying cause.",
        "This could be dengue fever or other digestive issues. Seeking medical attention is essential, especially if vomiting is severe or persistent, to prevent dehydration and receive proper treatment.",
        "High fever, sweating, and muscle pain can be symptoms of dengue fever. Seeing a doctor for diagnosis and treatment is crucial, as they can significantly affect your daily activities.",
        "This could be dengue fever or other viral infections. Consulting a doctor to rule out underlying conditions and discuss treatment options is recommended.",
        "Severe headache, pressure in the head, mild fever, and red spots could be caused by dengue fever, migraines, or other headache disorders. Seeing a doctor for diagnosis and treatment is crucial to manage the headache and fever.",
        "This could be dengue fever or other digestive issues. Seeking medical attention to prevent dehydration and receive proper treatment is important.",
        "This could be signs of dengue fever. Seeing a doctor for diagnosis and treatment to manage pain and discomfort is crucial.",
        "This could be dengue fever, but other illnesses can also cause similar symptoms. It's crucial to seek immediate medical attention for proper diagnosis and treatment. Don't delay, especially if the fever or itching is severe."
    ]
    },
    {   
    "tag": "Fungal infection",
    "phrases": [
        "I have raised lumps, a rash that looks red and inflamed, discoloured areas of skin that are different colours from the rest of my skin, and itching on my skin.",
        "All over my body, there has been a severe itching that has been followed by a red, bumpy rash. My skin also has a few darkened spots and a few tiny, nodular breakouts. It has been happening for several days and is becoming worse.",
        "I've had a rash on my skin that looks like dischromic patches, and I also have a lot of nodular eruptions and really bad itching. During the previous week, it has become worse.",
        "I've had a rash that won't go away and a bothersome itching on my skin. In addition, I've seen some color-different areas and bumps that resemble knots or lumps on my skin.",
        "I have a rash all over my body, and I can't stop scratching because my skin is itchy. My skin also has a few spots where the hue is altered and some lumps and knot-like pimples.",
        "Recently, my skin has been quite itchy, and I have a rash all over my body. My skin also has a few spots where the hue is altered and some lumps and knot-like pimples.",
        "My skin has been itching a lot and developing a rash. Additionally, I have a few areas of my skin that are a different hue than the rest of it. Additionally, I have a few firm pimples or breakouts on my skin.",
        "All over my body has been itching like crazy, and now there are red areas all over. Additionally, some of the patches have a different tone than my natural skin. And on my skin, there are these lumps or pimples that have developed.",
        "My skin has been acting up recently, becoming extremely itchy and rashes-prone. Additionally, there are certain spots that deviate from my natural skin tone in terms of hue. And now my skin has these lumps or bumps that weren't there before.",
        "On my arms and legs, I have a lot of red pimples and itchy skin. My skin also has a few odd-looking lesions. And occasionally there are bumps that are somewhat uncomfortable.",
        "I have an itchy skin and lots of red bumps on my arms and legs. There are some weird looking spots on my skin too. And sometimes there are bumps that feel kind of hard.",
        "Doctor, I have a really itchy rash on my skin and there are some weird spots that are a different color. There are also some bumps on my skin that look like little knots",
        "Doctor, My skin is covered in a very uncomfortable rash, along with some odd patches of a different hue. My skin also has a few pimples that resemble little knots",
        "I have lots of itchy spots on my skin, and sometimes they turn red or bumpy. There are also some weird patches that are different colors than the rest of my skin, and sometimes I get these weird bumps that look like little balls.",
        "My skin frequently develops itchy bumps that can occasionally turn red or rough. Aside from that, my skin occasionally develops strange pimples that resemble small balls and some odd spots that are a different hue from the rest of my skin.",
        "Doctor, I have these red rashes that keep popping up and my skin is continuously itching. In addition, I've observed some odd color-different spots on my skin, as well as some little nodules on my skin that appear to be expanding.",
        "I have been experiencing some really intense itching all over my body, along with redness and bumps on my skin. There are also these weird patches that are different colors than the rest of my skin, and sometimes I get these nodules that look like small bumps.",
        "All over my body, I've been scratching so much that my skin has become red and developed pimples. Additionally, I occasionally get these nodules that resemble little pimples, as well as these strange patches that are a different hue from the rest of my skin.",
        "I've been experiencing a lot of itching, which has been accompanied by a rash that appears to be growing worse over time. There are also certain areas of skin that are different colours from the rest, and I've spotted several lumps that resemble little nodes."
    ],
    "responses": [
        "These symptoms, particularly the rash and itching, could be signs of a fungal infection, but other skin conditions can also cause similar symptoms. Seeking professional medical attention for proper diagnosis and treatment is crucial.",
        "Itchy, bumpy rashes with discoloration can be caused by fungal infections, but also by allergies or other skin conditions. Seeing a doctor for diagnosis and treatment is important to identify the cause and get relief from the itching.",
        "The described symptoms could be caused by a fungal infection, eczema, or another skin condition. Consulting a doctor for diagnosis and treatment is recommended to find the underlying cause and manage the itching.",
        "Rashes, itching, and discoloration can be signs of various skin conditions, including fungal infections. Seeing a doctor for diagnosis and treatment is crucial to determine the cause and get appropriate treatment.",
        "Itchy rashes with discoloration and bumps can be caused by fungal infections, but also by other skin conditions. Seeking medical attention for diagnosis and treatment is important to identify the cause and get relief.",
        "Similar to other entries, these symptoms point to the possibility of a fungal infection or other skin conditions. Seeing a doctor for diagnosis and treatment is crucial to determine the cause and get appropriate care.",
        "While a fungal infection is possible, these symptoms could also be caused by other skin conditions. Consulting a doctor for diagnosis and treatment is recommended to identify the cause and manage the itching.",
        "The intense itching and rash raise concerns about a possible fungal infection or other skin condition. Seeing a doctor for diagnosis and treatment is crucial to determine the cause and get appropriate relief.",
        "These symptoms could be caused by a fungal infection, allergies, or other skin conditions. Seeing a doctor for diagnosis and treatment is important to identify the cause and get relief from the itching and discomfort.",
        "These symptoms, particularly the itchy skin, red pimples, and bumps, could be signs of a fungal infection, but other skin conditions can also cause similar symptoms. Seeing a doctor for diagnosis and treatment is important to identify the cause and get relief from the itching and discomfort.",
        "Itchy skin, red bumps, and weird-looking spots can be caused by fungal infections or other skin conditions. Consulting a doctor for diagnosis and treatment is recommended to determine the cause and get appropriate care.",
        "Itchy rash, weird-colored spots, and knot-like bumps raise concerns about a possible fungal infection or other skin condition. Seeing a doctor for diagnosis and treatment is crucial to determine the cause and get appropriate relief.",
        "Uncomfortable rash, odd-colored patches, and knot-like pimples again suggest the possibility of a fungal infection or other skin condition. Consulting a doctor for diagnosis and treatment is recommended to identify the cause and manage the discomfort.",
        "Itchy spots, red and bumpy patches, weird-colored areas, and ball-like bumps are potential signs of a fungal infection or other skin condition. Seeing a doctor for diagnosis and treatment is crucial to determine the cause and get appropriate care.",
        "Itchy bumps, red/rough patches, weird pimples, and odd-colored areas suggest the possibility of a fungal infection or other skin condition. Consulting a doctor for diagnosis and treatment is recommended to identify the cause and manage the itching and discomfort.",
        "Recurring red rashes, itching, odd-colored spots, and growing nodules warrant a doctor's visit. These symptoms, especially worsening over time, raise concerns about a possible fungal infection or other skin condition. Seeing a doctor for diagnosis and treatment is crucial to determine the cause and get appropriate care.",
        "The intense itching, rashes, and bumps suggest the possibility of a fungal infection or other skin condition. Consulting a doctor for diagnosis and treatment is recommended to identify the cause and get relief from the discomfort.",
        "Itchy rashes, discoloration, and bumps suggest the possibility of a fungal infection or other skin condition. Seeing a doctor for diagnosis and treatment is crucial to determine the cause and get appropriate care.",
        "Itchy rashes, discoloration, and bumps, especially worsening over time, raise concerns about a possible fungal infection or other skin condition. Consulting"
    ]
    },
    {
    "tag": "Common Cold",
    "phrases": [
        "I can't stop sneezing and my nose is really runny. I'm also really cold and tired all the time, and I've been coughing a lot. My fever is really high too, like way above normal.",
        "My nose is extremely runny, and I can't seem to stop sneezing. In addition, I constantly feel cold, exhausted, and I've been coughing a lot. My fever is also really high far above normal.",
        "I've been sneezing nonstop and I can't seem to shake this chill. I'm feeling really weak and tired, and my cough won't go away. My fever is really high",
        "I've been sneezing incessantly and I just can't get this chill to go away. I feel so weak and exhausted, and my cough won't stop. My temperature is really high.",
        "I'm constantly sneezing and my body is shaking from being cold. I'm so tired I can barely move and my head is killing me. My fever is through the roof",
        "I'm constantly sneezing, and the cold is making my body tremble. I'm so exhausted that I can hardly move, and my head hurts. My fever is quite high.",
        "I've been quite exhausted and ill. I'm sneezing nonstop and am quite cold. My head is throbbing, and I lack energy. Additionally, I have a very high fever and feel like I am on fire.",
        "I've been feeling really tired and sick. I've been sneezing a lot and I can't seem to get warm. I'm so tired and my head is killing me. And my fever is really high, like I'm boiling.",
        "I've been quite exhausted and ill. My throat has been quite painful, and I've had a fairly nasty cough. I've got a lot of chills and a pretty high temperature. Just feeling extremely run down and weak",
        "I've been quite exhausted and ill. I have been sneezing a lot and am having trouble warming up. I'm so exhausted, and my head hurts. And I feel like I am boiling over with my high temperature.",
        "I can't stop sneezing and I feel really tired and crummy. My throat is really sore and I have a lot of gunky stuff in my nose and throat. My neck feels swollen and puffy too.",
        "I can't stop sneezing, and I'm exhausted and sick. My throat is really uncomfortable, and there is a lot of junk in my nose and throat. My neck is also swollen and puffy.",
        "I keep sneezing, and I'm miserable and exhausted. I have a lot of gunky things in my nose and throat, and my throat is really hurting. My neck also feels puffy and swollen.",
        "I've been feeling really exhausted and sick to my stomach. I've had a really bad cough and my throat has hurt a lot. I've experienced substantial sinus pressure and a congested nose. I'm really unpleasant and worn out.",
        "I've been sneezing a lot and feeling really tired and sick. There's also a lot of gross stuff coming out of my nose and my throat feels really scratchy. And my neck feels swollen too.",
        "I've been wheezing a lot and am generally feeling sick and exhausted. My throat feels really scratchy, and a lot of gross stuff is flowing out of my nose. My neck also feels bloated.",
        "My sinuses feel incredibly congested, and my eyes are continuously red. I just constantly feel drained and exhausted. In addition, I have a lot of uncomfortable phlegm in my throat. My lymph nodes feel bloated, and breathing has been challenging.",
        "My eyes have been really red and my sinuses feel congested. I just don't have any energy and my throat has been really itchy. I've also noticed my lymph nodes are swollen and I've been coughing up a lot of phlegm.",
        "My sinuses feel stuffy, and my eyes have been quite red. I simply lack energy, and my throat has been really scratchy. Along with the swelling in my lymph nodes, I've also been coughing up a lot of phlegm.",
        "My eyes are always red and itchy, and my nose feels all stuffy and congested. I just feel kind of sick and tired all the time, and I keep coughing up all this gunk. My throat feels sore and scratchy, and I've noticed that the bumps on my neck are bigger than usual.",
        "My nose always feels stuffy and congested, and my eyes are always red and itching. I have a feeling of being unwell and fatigued, and I keep hacking up this gunk. I have a scratchy, irritated throat, and I've seen that my neck's bumps are larger than usual."
    ],
    "responses": [
        "These symptoms are consistent with a common cold, but other illnesses can also cause similar symptoms. While most colds resolve on their own, seeing a doctor is crucial if your fever is very high, symptoms worsen, or you have underlying health conditions.",
        "These symptoms align with a common cold, but consulting a doctor is important if the fever is very high, symptoms worsen, or you have underlying health conditions.",
        "While these symptoms suggest a common cold, the severity, particularly the nonstop sneezing and high fever, warrants consulting a doctor to rule out other possibilities and get appropriate care.",
        "The severity of the symptoms, especially the incessant sneezing and high fever, necessitates seeing a doctor for diagnosis and appropriate management.",
        "The combination of these symptoms points towards a possible common cold, but the severity, including the high fever and intense chills, justifies seeking medical attention for diagnosis and guidance.",
        "The severity of the symptoms, particularly the high fever and persistent chills, suggests consulting a doctor for a diagnosis and personalized care plan.",
        "While these symptoms align with a common cold, the additional details like head throbbing and feeling like being on fire warrant seeing a doctor to rule out other possibilities and ensure proper management.",
        "The additional details like feeling like boiling and the severity of the symptoms suggest consulting a doctor for diagnosis and appropriate care.",
        "This description suggests a possible common cold, but the sore throat and cough could also indicate other illnesses. Seeing a doctor is crucial if the fever is high, symptoms worsen, or you have underlying health conditions.",
        "These symptoms align with a common cold, but the additional details like feeling like boiling over and the severity of the symptoms suggest consulting a doctor for diagnosis and personalized care.",
        "These symptoms suggest a possible common cold, but the swollen lymph nodes could indicate other illnesses. Seeing a doctor is crucial if the fever is high, symptoms worsen, or you have underlying health",
        "These symptoms suggest a possible common cold, but the swollen lymph nodes could indicate other illnesses. Seeing a doctor is crucial if the fever is high, symptoms worsen, or you have underlying health conditions.",
        "These symptoms align with a common cold, but consulting a doctor is important if the symptoms worsen, you have underlying health conditions, or the swollen lymph nodes persist.",
        "While these symptoms can occur with a common cold, the nausea and cough raise concerns about other possibilities. Seeing a doctor for diagnosis and appropriate treatment is crucial.",
        "These symptoms suggest a possible common cold, but the swollen lymph nodes could indicate other illnesses. Seeing a doctor is crucial if the fever is high, symptoms worsen, or you have underlying health conditions.",
        "Wheezing can be a serious symptom, especially if accompanied by difficulty breathing. While it can occur with a common cold in some cases, consulting a doctor immediately is crucial for diagnosis and appropriate treatment.",
        "These symptoms, particularly the difficulty breathing and swollen lymph nodes, warrant immediate medical attention. While some could be related to a common cold, they could also indicate more serious conditions.",
        "The combination of symptoms, especially the swollen lymph nodes and phlegm, necessitates seeing a doctor to rule out other possibilities and get appropriate care.",
        "These symptoms suggest a possible common cold, but the swollen lymph nodes could indicate other illnesses. Seeing a doctor is crucial if the fever is high, symptoms worsen, or you have underlying health conditions.",
        "While some of these symptoms align with a common cold, the red and itchy eyes, persistent cough, and swollen lymph nodes suggest consulting a doctor for diagnosis and appropriate treatment.",
        "The combination of symptoms, especially the red and itchy eyes, persistent cough, and swollen lymph nodes, warrants seeing a doctor for diagnosis and appropriate treatment."
    ]
    },
    {
    "tag": "Pneumonia",
    "phrases": [
        "I've been feeling really cold and tired lately, and I've been coughing a lot with chest pain. My heart is beating really fast too, and when I cough, the phlegm is kind of a rusty color.",
        "I've been coughing a lot recently with chest pain and feeling incredibly chilly and exhausted. Additionally, my heart is thumping rapidly, and the phlegm I cough up has a reddish hue.",
        "I've been feeling really drained and cold, and I can't stop coughing. It hurts in my chest when I do, and my heart feels like it's racing. The mucus I'm coughing up is a gross brownish color.",
        "I've been exhausted and chilly, and I can't stop coughing. When I do, it pains in my chest and makes my heart race. My coughing mucous has a disgusting brownish hue.",
        "I've been having chills and feeling exhausted, and I can't seem to shake this cough. My chest hurts when I cough, and my heart feels like it's going a million miles an hour. The phlegm I'm coughing up is a dirty rust color.",
        "I've been experiencing chills, feeling worn out, and I can't seem to get rid of this cough. When I cough, my chest aches and my heart feels as like it is beating a million miles per hour. I'm coughing up a nasty rust-colored phlegm.",
        "I've been feeling really weak and cold lately, and this cough won't go away. It hurts in my chest when I cough, and my heart is pounding. The mucus I'm bringing up is a rusty brown color.",
        "I've been having chills and feeling really worn out, and this cough won't go away. My chest hurts when I cough, and my heart is racing. The mucus I'm bringing up is a gross brownish color.",
        "I'm having problems breathing and have a very high fever. I'm perspiring a lot and experiencing extreme fatigue and chilly. My heart is racing, and I'm coughing up some brownish mucus.",
        "My temperature is very high, and I'm having a hard time breathing. I'm sweating profusely, and I'm shaking with chills. I'm really tired, and my heart is beating really fast. I also have some brownish phlegm coming up",
        "I'm having trouble breathing, and my fever is really high. I'm drenched in sweat and shivering from the chill. My heart is thumping rapidly, and I'm quite exhausted. Additionally, I'm about to have some brownish phlegm.",
        "My fever is really high, and I'm having trouble catching my breath. I'm sweating a lot, feeling cold and tired, and my heart is beating really fast. I also have some brownish phlegm coming up.",
        "I have a really high fever, and I have problems breathing. My heart is racing quite quickly, I'm perspiring a lot, and I feel chilly and exhausted. I'm also about to cough out some brownish phlegm.",
        "I've been feeling really sick with a high fever, shortness of breath, sweating, chills, and extreme fatigue. My heart rate is rapid, and I've been coughing up a lot of brownish sputum.",
        "With a high temperature, shortness of breath, sweating, chills, and intense exhaustion, I've been feeling quite poorly. I've been coughing up a lot of brownish phlegm and my pulse rate is racing.",
        "I'm having a really hard time catching my breath and I'm sweating a lot. I feel really sick and have a lot of mucus in my throat. My chest hurts and my heart is racing. The mucus I'm coughing up is dark and looks like rust."
    ],
    "responses": [
        "While your symptoms could be pneumonia, they could also indicate other respiratory infections like bronchitis or asthma. The rusty-colored phlegm is concerning, and the chest pain and rapid heartbeat warrant immediate medical attention. Please see a doctor right away for a proper diagnosis and treatment plan.",
        "The combination of cough, chest pain, fatigue, rapid heartbeat, and reddish phlegm is concerning and needs immediate medical evaluation. While pneumonia is a possibility, other conditions like bronchitis or even heart issues could be at play. Don't delay, see a doctor right away for diagnosis and treatment.",
        "Your persistent cough, chest pain, rapid heartbeat, and brownish mucus raise red flags. While pneumonia could be the culprit, other respiratory infections or even heart problems are possibilities. It's crucial to seek immediate medical attention for a proper diagnosis and treatment plan. Don't wait, your health matters.",
        "The combination of exhaustion, chills, persistent cough, chest pain, rapid heartbeat, and brownish phlegm is concerning and indicates the need for immediate medical attention. While pneumonia is a possibility, other respiratory illnesses or even heart issues could be involved. Don't hesitate, see a doctor right away for proper diagnosis and treatment.",
        "Experiencing chills, exhaustion, persistent cough with chest pain, rapid heartbeat, and rusty-colored phlegm warrants immediate medical attention. While pneumonia is a possibility, other respiratory infections or even heart problems could be the cause. Don't wait, see a doctor right away for diagnosis and appropriate treatment.",
        "The chills, fatigue, persistent cough with chest pain, rapid heartbeat, and rusty-colored phlegm you're experiencing require immediate medical attention. While pneumonia is a possibility, other respiratory infections or even heart problems could be involved. Don't delay, see a doctor right away for diagnosis and proper treatment.",
        "Feeling weak, cold, having a persistent cough with chest pain, rapid heartbeat, and rusty brown phlegm needs immediate medical attention. While pneumonia is a possibility, other respiratory infections or even heart problems could be the cause. Don't hesitate, see a doctor right away for diagnosis and appropriate treatment.",
        "Experiencing chills, fatigue, persistent cough with chest pain, rapid heartbeat, and brownish mucus necessitates immediate medical attention. While pneumonia is a possibility, other respiratory infections or even heart problems could be involved. Don't delay, see a doctor right away for diagnosis and proper treatment.",
        "It sounds like you might be experiencing pneumonia, which is a serious infection of the lungs. It's important to seek medical attention immediately, especially if you are having trouble breathing, experiencing chest pain, or coughing up blood.",
        "Your symptoms are concerning and could be indicative of pneumonia. Please don't hesitate to seek medical attention right away, especially if your condition worsens.",
        "Given your symptoms, it's crucial to get a medical evaluation as soon as possible. Pneumonia can be serious, and early diagnosis and treatment are essential.",
        "Based on your description, pneumonia is a possible cause of your symptoms. Please consult a healthcare professional promptly to receive a proper diagnosis and treatment plan.",
        "The combination of fever, difficulty breathing, and coughing up brownish mucus suggests pneumonia. It's important to seek medical attention as soon as possible to confirm the diagnosis and get appropriate treatment.",
        "Your symptoms warrant immediate medical attention. Pneumonia can be life-threatening, and early intervention is crucial. Please don't delay in seeking medical help.",
        "It's imperative to seek medical attention immediately, given your concerning symptoms. Pneumonia can be serious, and prompt diagnosis and treatment are essential for a full recovery.",
        "Based on your description, it's important to get evaluated by a healthcare professional as soon as possible. Your symptoms could be indicative of pneumonia, which requires prompt medical attention."
    ]
    }
   ]
}


  